1. Как выглядит структура django MVT паттерна (можно упрощённо)? Можно словами, можно нарисовать схему.  
3. Как выглядит структура проекта и приложения в Django? Если конкретнее, то что за файлы внутри каждого из них и для чего?  
5. Что такое модели в Django? Покажите пример модели и расскажите об их структуре.  
7. Что такое контроллеры или вью в Django? Покажите пример функции-контроллера и класса-контроллера и расскажите об их структуре.  
9. Что такое статические файлы и какие настройки определяют место их сбора и хранения?  
11. В чём разница между CharField и Textfield.  
13. Что такое csrf? Как его подключить к форме?  
15. Можно ли использовать команду runserver для запуска «боевого проекта» и почему нет?  
17. Что такое кеширование? Какие способы кеширования есть в Django?  
19. Django это CMS? Если нет, в чём отличия.  
21. Что такое шаблоны Jinja?  
23. Как фильтровать элементы в модели?  
25. Как использовать django ORM для создания данных партиями / пачкой?  
27. Что такое django ORM? Как получить все записи с модели? Как их отфильтровать или искать внутри? Перечислите все методы ORM.  
29. Разница между связью ForeignKey и OneToOne? Расскажите о примере использования обеих.   +
31. Объясните авторизацию пользователя в Django?  
33. В чём разница между select_related и prefetc_related? Покажите синонемичный код на SQL.  + 
35. Расскажите о безопасности Django.  
37. Какой цикл ответа и запроса в Django?    + 